-- -------------------------------------------------------------------------------
-- ЗАПРОСЫ НА ВЫПОЛНЕНИЕ ВЫБОРОК
-- -------------------------------------------------------------------------------

-- Выбор всех элементов и строк в таблице "Склад" и группировка по алфавиту столбца "Компании (ltd)":
SELECT * FROM warehouse
    ORDER BY ltd;

-- Выбор наименования склада (name_wh, адрес склада (address_wh), номера телефона склада (phone_wh) из таблицы "Склад":
SELECT name_wh,address_wh, phone_wh
    FROM warehouse
    WHERE ltd = "Wildberries"
    ORDER BY name_wh DESC;