-- -------------------------------------------------------------------------------
-- ЗАПРОСЫ НА ЗАПОЛНЕНИЕ ТАБЛИЦ
-- -------------------------------------------------------------------------------

-- Заполнение таблицы №1 - Склад:
INSERT INTO warehouse (name_wh, ltd, address_wh, phone_wh)
    VALUES ("ЛИНК", "ЛИНК", "300028, РФ, Тульская область, г. Тула, ул. Болдина, д. 94", "+7(4872)21-22-14 (доб. 105)"),
        ("ПЕТРОВСКОЕ_РФЦ", "OZON", "143541, РФ, Московская область, г. Истра, с. Петровское, территория МПСК Ориентир-Запад, зд. 1А", "+7(495)232-10-00 (доб. 71953)"),
        ("ЖУКОВСКИЙ_РФЦ", "OZON", "140182, РФ, Московская область, г. Жуковский, район Замоскворечье, д. 457, стр. 5", "+7 915 130-41-80"),
        ("СЦ_Омск_ВБ", "Wildberries", "644105, РФ, Омская область, г. Омск, ул. Раздольная, д. 1А", "+7 974 152-42-31");

-- Заполнение таблицы №2 - Секция:
INSERT INTO sections (id_wh, row, segment)
    VALUES ("", "", ""),
        ("", "", ""),
        ("", "", ""),
        ("", "", ""),
        ("", "", ""),
        ("", "", "");

-- Заполнение таблицы №3 - Ячейки:
INSERT INTO cells (id_section, num_cell, status_cell)
    VALUES ("", "", ""),
        ("", "", ""),
        ("", "", ""),
        ("", "", ""),
        ("", "", ""),
        ("", "", "");

-- Заполнение таблицы №4 - Ячейки:
INSERT INTO items (id_cell, classification)
    VALUES ("", ""),
        ("", ""),
        ("", ""),
        ("", ""),
        ("", ""),
        ("", "");
